---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.TransientElementCreationException
source: html/3c5c5775-3c7a-4d07-35b1-ab1c0da7b633.htm
---
# TransientElementCreationException Methods

Retrieves data needed to serialize the target object.